In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'NOME':['JOAO','ALEX','BRUNO','NICOLAS','CARLOS','RONALDO'],
                   'IDADE':[35,42,63,29,47,51],
                   'DOACAO':[100,93,78,120,64,115],
                   'TIME':['BOTAFOGO','VASCO','MADUREIRA','FLAMENGO','FLUMINENSE','VOLTA REDONDA']})
df

      NOME  IDADE  DOACAO           TIME
0     JOAO     35     100       BOTAFOGO
1     ALEX     42      93          VASCO
2    BRUNO     63      78      MADUREIRA
3  NICOLAS     29     120       FLAMENGO
4   CARLOS     47      64     FLUMINENSE
5  RONALDO     51     115  VOLTA REDONDA

- Quais registros correspondem a doações superiores a 60 reais de torcedores com idade superior a 40 anos para times que começam com a letra F?

1. LOC

In [6]:
df.loc[(df['DOACAO']>60)&(df['IDADE']>40)&(df['TIME'].str.startswith('F'))]

     NOME  IDADE  DOACAO        TIME
4  CARLOS     47      64  FLUMINENSE

In [14]:
df.loc[(df['DOACAO']>60)&(df['IDADE']>40)&(df['TIME'].str.startswith('F')),['NOME','IDADE','TIME']]

     NOME  IDADE        TIME
4  CARLOS     47  FLUMINENSE

2. numpy.where()

In [7]:
import numpy as np

In [8]:
indice = np.where((df['DOACAO']>60)&(df['IDADE']>40)&(df['TIME'].str.startswith('F')))

In [9]:
indice

(array([4]),)

In [10]:
df.loc[indice]

     NOME  IDADE  DOACAO        TIME
4  CARLOS     47      64  FLUMINENSE

3. query()

In [20]:
df.query('DOACAO > 60 & IDADE > 40 & TIME.str.startswith("F").values')

     NOME  IDADE  DOACAO        TIME
4  CARLOS     47      64  FLUMINENSE

4. indexação booleana para multiplas condições

In [21]:
df[(df['DOACAO']>60)&(df['IDADE']>40)&(df['TIME'].str.startswith('F'))]

     NOME  IDADE  DOACAO        TIME
4  CARLOS     47      64  FLUMINENSE

In [26]:
df[(df['DOACAO']>60)&(df['IDADE']>40)&(df['TIME'].str.startswith('F'))][['TIME','DOACAO']]

         TIME  DOACAO
4  FLUMINENSE      64